// order status color

export const OrderStatusColor: any = {
  // В ожидании
  0: '#FFC107',
  //Принятые
  1: '#9C27B0',
  //Отмененые
  2: '#F44336',
  //На доставке/Ожидается отправка
  3: '#03A9F4',
  //В пути/Отправленные
  4: '#FFEB3B',
  //Доставленные
  5: '#4CAF50',
  //Ожидается оплата
  6: '#FF9800',
  //Оплаченые
  7: '#009688',
  //Ожидает отзыв
  9: '#8BC34A',
};
export const OrderStatusBacgroundColor: any = {
  // В ожидании
  0: '#729EDB',
  //Принятые
  1: '#9C27B0',
  //Отмененые
  2: '#F44336',
  //На доставке/Ожидается отправка
  3: '#03A9F4',
  //В пути/Отправленные
  4: '#FFEB3B',
  //Доставленные
  5: '#4CAF50',
  //Ожидается оплата
  6: '#DB2121 ',
  //Оплаченые
  7: '#009688',
  //Ожидает отзыв
  9: '#8BC34A',
};

export const OrderStatusText: any = {
  0: 'В ожидании',
  1: 'Принятые',
  3: 'На доставке/Ожидается отправка',
  4: 'В пути/Отправленные',
  6: 'Ожидается оплата',
  7: 'Оплаченые',
};
export const OrderStatusTextNoActive: any = {
  2: 'Отмененые',
  9: 'Ожидает отзыв',
  5: 'Доставленные',
};
